resources/xmlfiles/workday/submit_supplier_invoice.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bsvc="urn:com.workday/bsvc"><SOAP-ENV:Header/><SOAP-ENV:Body><bsvc:Submit_Supplier_Invoice_Request bsvc:version="v33.2"><bsvc:Business_Process_Parameters><bsvc:Auto_Complete>1</bsvc:Auto_Complete></bsvc:Business_Process_Parameters><bsvc:Supplier_Invoice_Data><bsvc:Submit>1</bsvc:Submit><bsvc:Tax_Amount>10</bsvc:Tax_Amount><bsvc:Default_Tax_Option_Reference><bsvc:ID bsvc:type="Tax_Option_ID">ENTER_TAX_DUE</bsvc:ID></bsvc:Default_Tax_Option_Reference><bsvc:Company_Reference><bsvc:ID bsvc:type="Company_Reference_ID">GMS_Canada</bsvc:ID></bsvc:Company_Reference><bsvc:Currency_Reference><bsvc:ID bsvc:type="Currency_ID">CAD</bsvc:ID></bsvc:Currency_Reference><bsvc:Payment_Terms_Reference><bsvc:ID bsvc:type="Payment_Terms_ID">NET_30</bsvc:ID></bsvc:Payment_Terms_Reference><bsvc:Supplier_Reference><bsvc:ID bsvc:type="Supplier_ID">S-0033</bsvc:ID></bsvc:Supplier_Reference><bsvc:Ship-To_Address_ID_Reference><bsvc:ID bsvc:type="Address_ID">ADDRESS_REFERENCE-6-2029</bsvc:ID></bsvc:Ship-To_Address_ID_Reference><bsvc:Invoice_Line_Replacement_Data><bsvc:Purchase_Item_Reference><bsvc:ID bsvc:type="Purchase_Item_ID">ALCOHOL_SWABS</bsvc:ID></bsvc:Purchase_Item_Reference><bsvc:Tax_Applicability_Reference><bsvc:ID bsvc:type="Tax_Applicability_ID">VertexTaxApplicability</bsvc:ID></bsvc:Tax_Applicability_Reference><bsvc:Worktags_Reference><bsvc:ID bsvc:type="Cost_Center_Reference_ID">10000</bsvc:ID></bsvc:Worktags_Reference><bsvc:Quantity>1</bsvc:Quantity><bsvc:Unit_Cost>3.26</bsvc:Unit_Cost><bsvc:Extended_Amount>3.26</bsvc:Extended_Amount></bsvc:Invoice_Line_Replacement_Data></bsvc:Supplier_Invoice_Data></bsvc:Submit_Supplier_Invoice_Request></SOAP-ENV:Body></SOAP-ENV:Envelope>